	IDENTIFICATION DIVISION.
	PROGRAM-ID. loopthru.
	ENVIRONMENT DIVISION.
	DATA DIVISION.
	PROCEDURE DIVISION.
	MULAI.
	PROG-A.
	      DISPLAY "INI PARA-1"
		  PERFORM PROG-D THRU PROG-F
	PROG-B
	      DISPLAY "INI PARA-2"
	PROG-C
	      DISPLAY "INI PARA-3"
		  STOP RUN.
	PROG-D
	      DISPLAY "INI PARA-4"
	PROG-E
	      DISPLAY "INI PARA-5"
	PROG-F
	      DISPLAY "INI PARA-6"