	IDENTIFICATION DIVISION.
	PROGRAM-ID. loopvar.
	ENVIRONMENT DIVISION.
	DATA DIVISION.
	WORKING-STORAGE SECTION.
	77 X PIC 9
	77 Y PIC 9.
	PROCEDURE DIVISION.
	MULAI.
	     DISPLAY "MASUKKAN JUMLAH LOOPING : ", ACCEPT X.
		 PERFORM CETAK VARYING Y FROM 0 BY 1 UNTIL Y=X.
		 GO TO SELESAI.
	CETAK.
	     DISPLAY "LOOPING VARYING KE- " Y.
	SELESAI.
	     STOP RUN.