	IDENTIFICATION DIVISION.
	PROGRAM-ID. loop9.
	ENVIRONMENT DIVISION.
	DATA DIVISION.
	WORKING-STORAGE SECTION.
	77 PIL PIC 9.
	PROCEDURE DIVISION.
	MULAI.
	     DISPLAY "MASUKKAN ANGKA [1-6]: ". ACCEPT PIL.
		 GO TO PROG-A PROG-B PROG-C PROG-D
		 PROG-E PROG-F DEPENDING PIL.
	PROG-A.
	      DISPLAY "INI PARA-1".
	PROG-B.
	      DISPLAY "INI PARA-2".
	PROG-C.
	      DISPLAY "INI PARA-3".
	PROG-D.
	      DISPLAY "INI PARA-4".
	PROG-E.
	      DISPLAY "INI PARA-5".
	PROG-F.
	      DISPLAY "INI PARA-6".