IDENTIFICATION DIVISION.
PROGRAM-ID. LEVEL-NUMBER.
AUTHOR. KELOMPOKMAMAN.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DATA-MASUKAN.
02 NAMA PIC A(20).
02 GAJI.
03 GAJI-POKOK PIC 9(8).
03 TUNJANGAN PIC 9(8).
03 TOTAL-GAJI PIC Z(8).
01 TANYA PIC A.
88 LAGI VALUE IS 'Y', 'y'.
88 TIDAK VALUE IS 'T', 't'.
SCREEN SECTION.
01 HAPUS-LAYAR.
02 BLANK SCREEN.
PROCEDURE DIVISION.
MULAI.
MASUKKAN-DATA.
DISPLAY HAPUS-LAYAR.
DISPLAY (1,1)'NAMA ANDA :'.
ACCEPT NAMA.
DISPLAY (2,1) 'GAJI POKOK :Rp.'.
ACCEPT GAJI-POKOK.
DISPLAY (3,1) 'BESARNYA TUNJANGAN :Rp.'.
ACCEPT TUNJANGAN.
HITUNG-GAJI.
COMPUTE TOTAL-GAJI = GAJI-POKOK + TUNJANGAN.
CETAK-HASIL.
DISPLAY HAPUS-LAYAR.
DISPLAY'xxxxxxxx GAJI ANDA UNTUK BULAN INI xxxxxxxxx'.
DISPLAY ''.
DISPLAY 'NAMA :', NAMA.
DISPLAY 'GAJI POKOK :Rp.', GAJI-POKOK.
DISPLAY 'BESARNYA TUNJANGAN :Rp.', TUNJANGAN.
DISPLAY 'TOTAL GAJI :Rp.', TOTAL-GAJI.
TANYAKAN.
DISPLAY SPACE.
DISPLAY 'INGIN MENGHITUNG GAJI YANG LAIN (Y/T) ?'.
ACCEPT TANYA.
IF LAGI GO TO MASUKKAN-DATA.
SELESAI.
STOP RUN.