	IDENTIFICATION DIVISION.
	PROGRAM-ID. testimes.
	ENVIRONMENT DIVISION.
	DATA DIVISION.
	WORKING-STORAGE SECTION.
	77 X PIC 9.
	77 Y PIC 9 VALUE 0.
	PROCEDURE DIVISION.
	MULAI.
	      DISPLAY "MASUKKAN JUMLAH LOOPING : ", ACCEPT X.
		  PERFORM CETAK X TIMES.
		  GO TO SELESAI.
	CETAK.
	      DISPLAY "LOOPING TIMES KE- " Y.
		  ADD 1 TO Y.
	SELESAI.
	      STOP RUN.