     IDENTIFICATION DIVISION.
	 PROGRAM-ID. tesuntil.
	 ENVIRONMENT DIVISION.
	 DATA DIVISION.
	 WORKING-STORAGE SECTION.
	 77 X PIC 9.
	 77 Y PIC 9 VALUE 0.
	 PROCEDURE DIVISION.
	 MULAI.
	      DISPLAY "MASUKKAN JUMLAH LOOPING : ", ACCEPT X.
		  PERFORM CETAK UNTIL Y > X.
		  GO TO SELESAI.
	 CETAK.
	      DISPLAY "LOOPING UNTIL KE; " Y.
		  COMPUTE Y = Y + 1.
	 SELESAI.
	      STOP RUN.