IDENTIFICATION DIVISION.
	PROGRAM-ID. UJIAN.
	AUTHOR. AJAYALF
	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
		SELECT MAHASISWA ASSIGN TO DISK
		ORGANIZATION IS LINE SEQUENTIAL
		FILE STATUS IS DT-MAHASISWA.
	DATA DIVISION.
	FILE SECTION.
	FD MAHASISWA
		LABEL RECORD IS STANDARD
		VALUE OF FILE-ID IS "DTMAHASISWA"
		DATA RECORD IS RECMAHASISWA.
	01 RECMAHASISWA.
		02 NPM PIC X(14).
        02 NAMA PIC X(23).
        02 KELAS PIC X(5).
	WORKING-STORAGE SECTION.
	77 DT-MAHASISWA PIC XX.
	01 MAHASISWA-0.
		02 NPM-O PIC X(14).
        02 NAMA-O PIC X(23).
        02 KELAS-O PIC X(5).
	77 PIL2 PIC 99.
	77 PIL PIC 99.
	01 KALKU.
		02 A1 PIC 9(4)V9(2).
		02 A2 PIC 9(4)V9(2).
		02 TMBH PIC -Z(6).9(2).
		02 KRNG PIC -Z(6).9(2).
		02 KALI PIC -Z(6).9(2).
		02 BAGI PIC -Z(6).9(2).
	01 BILANGAN.
		02 A PIC 99.
		02 HASIL PIC 99 VALUE 0.
		02 SISA PIC 99 VALUE 0.
		02 BIL PIC X(6).

	01 LAGII PIC X.
		88 YA VALUE "Y", "y".
		88 TIDAK VALUE "T", "t".
	SCREEN SECTION.
	01 CLS.
		02 BLANK SCREEN.
	01 ISI-DATA.
		02 LINE 3 COLUMN 5 "NAMA : " HIGHLIGHT.
		02 COLUMN PLUS 1 PIC X(23) TO NAMA.
		02 LINE 4 COLUMN 5 "KELAS : " HIGHLIGHT.
		02 COLUMN PLUS 1 PIC X(5) TO KELAS.
		02 LINE 5 COLUMN 5 "NPM : " HIGHLIGHT.
		02 COLUMN PLUS 1 PIC X(14) TO NPM.
		
	PROCEDURE DIVISION.		
	MENU.
		DISPLAY CLS.
		DISPLAY(10, 11)"..:: MENU UJIAN ::..".
		DISPLAY(11, 11)"1.Biodata		".
		DISPLAY(12, 11)"2.Ganjil & Genap	".
		DISPLAY(13, 11)"3.Kalkulator			".
		DISPLAY(14, 11)"4.Keluar			".	
		DISPLAY(15, 11)"PILIH MENU : ", ACCEPT PIL
		
		IF PIL = 1
			DISPLAY CLS
			GO TO MENUBIODATA.
		IF PIL = 2
			DISPLAY CLS
			GO TO ANTARA.
		IF PIL = 3
			DISPLAY CLS
			DISPLAY(12, 15)"MASUKKAN ANGKA 1 : ", ACCEPT A1
			DISPLAY(13, 15)"MASUKKAN ANGKA 2 : ", ACCEPT A2
			GO TO HITUNG.
		IF PIL = 4
			GO TO SELESAI.
		ELSE
			DISPLAY(9, 6)"HANYA 1 - 4".
			GO TO MENU.
			
	MENUBIODATA.
		DISPLAY(5, 6)"1.INPUT DATA ".
		DISPLAY(6, 6)"2.OUTPUT DATA".
		DISPLAY(7, 6)"3.KEMBALI ".
		DISPLAY(8, 6)"MASUKKAN PILIHAN KAMU : ".
		ACCEPT PIL2.
			IF PIL2 = 1
				GO TO BUKA-FILE.
			IF PIL2 = 2
				GO TO BUKA-FILE2.
			IF PIL2 = 3
				GO TO MENU.
			IF PIL = 4
				GO TO SELESAI.
			ELSE
				DISPLAY(9, 6)"HANYA 1 - 3".
				GO TO MENUBIODATA.
			
	BUKA-FILE.
		OPEN OUTPUT MAHASISWA.
		
	MULAI.
		DISPLAY CLS.
		DISPLAY ISI-DATA.
		ACCEPT ISI-DATA.
		WRITE RECMAHASISWA.
		
	TANYA-1.
		DISPLAY(10, 5)"ADA DATA LAGI? (Y/T) : "
		ACCEPT LAGII.
		IF YA GO TO MULAI
		IF TIDAK CLOSE MAHASISWA.
			DISPLAY CLS.
			GO TO MENUBIODATA.
		ELSE
			DISPLAY (, 5)"Y/T ONLY"
			GO TO TANYA-1.
		
	BUKA-FILE2.
		CLOSE MAHASISWA.
		OPEN INPUT MAHASISWA.
		
	MULAI2.
		DISPLAY CLS.
		DISPLAY "=======================================".
        DISPLAY "   NPM        NAMA                KELAS".
        DISPLAY "=======================================".
		
	BACA.
		READ MAHASISWA INTO MAHASISWA-0
		AT END GO TO TANYA-2.
		
	CETAK.
		DISPLAY(, 4) MAHASISWA-0.
		DISPLAY SPACE.
		GO TO BACA.
		
	TANYA-2.
		DISPLAY SPACE.
		DISPLAY "KEMBALI KE MENU? [Y/T] : "
		ACCEPT LAGII.
		IF YA CLOSE MAHASISWA.
			GO TO MENU.
		IF TIDAK GO TO SELESAI
		ELSE
			DISPLAY(, )"Y/T ONLY"
			GO TO TANYA-2.
		
	ANTARA.
		DISPLAY (1, 1) 'MASUKKAN BILANGAN : '.
		ACCEPT A.
		DISPLAY SPACE.
		DIVIDE 2 INTO A GIVING HASIL REMAINDER SISA.
		IF SISA = 0
			MOVE 'GENAP' TO BIL
		ELSE
			MOVE 'GANJIL' TO BIL.
		DISPLAY A, ' ADALAH BILANGAN ', BIL.
		GO TO ANTARALAGI.
		
	ANTARALAGI.
		DISPLAY(22, 18)"HITUNG LAGI Y/T ? ".
		ACCEPT LAGII.
		IF YA GO TO MENU.
		IF TIDAK GO TO SELESAI.
		ELSE
			DISPLAY(23, 15) "ONLY Y OR T".
			GO TO ANTARALAGI.
		
	HITUNG.
		COMPUTE TMBH = A1 + A2
		COMPUTE KRNG = A1 - A2
		COMPUTE KALI = A1 * A2
		COMPUTE BAGI = A1 / A2
		DISPLAY(14, 11)"TAMBAH	= " TMBH.
		DISPLAY(15, 11)"KURANG	= " KRNG.
		DISPLAY(16, 11)"KALI	= " KALI.
		DISPLAY(17, 11)"BAGI	= " BAGI.
		GO TO HITUNGLAGI.
		
	SELESAI.
		DISPLAY CLS.
		DISPLAY (15, 25) "PROGRAM KELUAR :) ".
		STOP RUN.
		
	HITUNGLAGI.
		DISPLAY(22, 18)"HITUNG LAGI Y/T ? ".
		ACCEPT LAGII.
		IF YA GO TO MENU.
		IF TIDAK GO TO SELESAI.
		ELSE
			DISPLAY(23, 15) "ONLY Y OR T".
			GO TO HITUNGLAGI.